# Задача: Напишите функцию, которая принимает на вход два числа и возвращает их произведение

def multiply_numbers(a, b):
    """
    Функция принимает два числа и возвращает их произведение.

    Args:
        a (int): Первое число.
        b (int): Второе число.

    Returns:
        int: Произведение двух чисел.
    """
    return a * b

# Пример использования функции
result = multiply_numbers(3, 5)
print(result)  # Вывод: 15
