# Задача: Напишите функцию, которая принимает на вход два числа и возвращает их сумму

def sum_numbers(a, b):
    """
    Функция принимает два числа и возвращает их сумму.

    Args:
        a (int): Первое число.
        b (int): Второе число.

    Returns:
        int: Сумма двух чисел.
    """
    return a + b

# Пример использования функции
result = sum_numbers(3, 5)
print(result)  # Вывод: 8
